<a href="https://colab.research.google.com/github/ksh001/ksh0011/blob/main/Py_Study_03_pd.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

##Serize : DataFrame 외에 데이터를 관리하는 형태

    colume이 하나임
    serize의 집합을 DataFrame이라 함
      잘 안쓰임. 생성/읽기만 보자

In [4]:
#series 만들기
s1 = pd.Series([500, 30, 2, 102])
s1

0    500
1     30
2      2
3    102
dtype: int64

In [6]:
#index만들기
s2 = pd.Series({ #key와 value : dictionary
    '1일차' : 300,
    '2일차' : 201,
    '3일차' : 200}
    )

s2

1일차    300
2일차    201
3일차    200
dtype: int64

In [10]:
s2.index = ('1일차', '2일차', '3일차')
s2.name = 'apple' #serize의 이름
s2.index.name ='data'
s2

data
1일차    300
2일차    201
3일차    200
Name: apple, dtype: int64

In [11]:
s2['1일차']

300

In [12]:
s2[['1일차', '2일차']]

data
1일차    300
2일차    201
Name: apple, dtype: int64

##Cheat Sheet

In [128]:
df = pd.DataFrame(
  {"a" : [4 ,5, 6, 6, 9],
  "b" : [7, 8, 6, 9, 77],
  "c" : [6, 10, 11, 12, 78]},
index = [1, 2, 3, 4, 5])

df

   a   b   c
1  4   7   6
2  5   8  10
3  6   6  11
4  6   9  12
5  9  77  78

In [52]:
df = (pd.melt(df)
          .rename(columns={
          'variable' : '칼럼이름',
          'value' : '값'})
          
          .query('값' >= 2')
)
df

    칼럼이름    값
0   칼럼이름    a
1   칼럼이름    a
2   칼럼이름    a
3   칼럼이름    b
4   칼럼이름    b
5   칼럼이름    b
6   칼럼이름    c
7   칼럼이름    c
8   칼럼이름    c
9      값    4
10     값    5
11     값    6
12     값    7
13     값    8
14     값    9
15     값   10
16     값   11
17     값  120

In [65]:
df['a'].value_counts()

6    2
5    1
4    1
Name: a, dtype: int64

In [64]:
df['a'].nunique()

3

In [80]:
df.dropna()#null값을 drop
df.fillna(value) #null에 값 넣기

NameError: ignored

In [87]:
df.assign(d = lambda df : df['a']*df['a']) #lambda : python이 함수를 만들 때 쓰는 문법/data 대입에 씀

   a  b   c   d    e
1  4  7   6  16  168
2  5  8  10  25  400
3  6  6  11  36  396
4  6  9  12  36  648

In [88]:
df['e'] = df.a*df.b*df.c
df

   a  b   c    d    e
1  4  7   6  168  168
2  5  8  10  400  400
3  6  6  11  396  396
4  6  9  12  648  648

In [132]:
df

   a   b   c
1  4   7   6
2  5   8  10
3  6   6  11
4  6   9  12
5  9  77  78

In [145]:
pd.qcut(df.a, 2, labels=False) #다음에 알아오기

1    0
2    0
3    0
4    0
5    1
Name: a, dtype: int64

ValueError: ignored